zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32c3-pinctrl.h
/**
 * @name LEDC_CH4
 * @{
 */
#define LEDC_CH4_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
/** @} */

/**
 * @name LEDC_CH5
 * @{
 */
#define LEDC_CH5_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT5)
#define LEDC_CH5_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT5)
#define LEDC_CH5_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT5)
#define LEDC_CH5_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT5)
#define LEDC_CH5_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT5)
#define LEDC_CH5_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT5)
#define LEDC_CH5_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT5)
#define LEDC_CH5_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT5)
#define LEDC_CH5_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT5)
#define LEDC_CH5_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT5)
#define LEDC_CH5_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT5)
#define LEDC_CH5_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT5)
#define LEDC_CH5_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT5)
#define LEDC_CH5_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT5)
#define LEDC_CH5_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT5)
#define LEDC_CH5_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT5)
#define LEDC_CH5_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT5)
#define LEDC_CH5_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT5)
#define LEDC_CH5_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT5)
#define LEDC_CH5_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT5)
#define LEDC_CH5_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT5)
#define LEDC_CH5_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT5)
/** @} */

/**
 * @name RMT_IN0
 * @{
 */
#define RMT_IN0_GPIO0  ESP32_PINMUX(0, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO1  ESP32_PINMUX(1, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO2  ESP32_PINMUX(2, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO3  ESP32_PINMUX(3, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO4  ESP32_PINMUX(4, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO5  ESP32_PINMUX(5, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO6  ESP32_PINMUX(6, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO7  ESP32_PINMUX(7, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO8  ESP32_PINMUX(8, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO9  ESP32_PINMUX(9, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO10 ESP32_PINMUX(10, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO11 ESP32_PINMUX(11, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO12 ESP32_PINMUX(12, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO13 ESP32_PINMUX(13, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO14 ESP32_PINMUX(14, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO15 ESP32_PINMUX(15, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO16 ESP32_PINMUX(16, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO17 ESP32_PINMUX(17, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO18 ESP32_PINMUX(18, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO19 ESP32_PINMUX(19, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO20 ESP32_PINMUX(20, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO21 ESP32_PINMUX(21, ESP_RMT_SIG_IN0, ESP_NOSIG)
/** @} */

/**
 * @name RMT_IN1
 * @{
 */
#define RMT_IN1_GPIO0  ESP32_PINMUX(0, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO1  ESP32_PINMUX(1, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO2  ESP32_PINMUX(2, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO3  ESP32_PINMUX(3, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO4  ESP32_PINMUX(4, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO5  ESP32_PINMUX(5, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO6  ESP32_PINMUX(6, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO7  ESP32_PINMUX(7, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO8  ESP32_PINMUX(8, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO9  ESP32_PINMUX(9, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO10 ESP32_PINMUX(10, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO11 ESP32_PINMUX(11, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO12 ESP32_PINMUX(12, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO13 ESP32_PINMUX(13, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO14 ESP32_PINMUX(14, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO15 ESP32_PINMUX(15, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO16 ESP32_PINMUX(16, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO17 ESP32_PINMUX(17, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO18 ESP32_PINMUX(18, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO19 ESP32_PINMUX(19, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO20 ESP32_PINMUX(20, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO21 ESP32_PINMUX(21, ESP_RMT_SIG_IN1, ESP_NOSIG)
/** @} */

/**
 * @name RMT_OUT0
 * @{
 */
#define RMT_OUT0_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_RMT_SIG_OUT0)
/** @} */

/**
 * @name RMT_OUT1
 * @{
 */
#define RMT_OUT1_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_RMT_SIG_OUT1)
/** @} */

/**
 * @name SPIM2_CSEL
 * @{
 */
#define SPIM2_CSEL_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_FSPICS0_OUT)
/** @} */

/**
 * @name SPIM2_CSEL1
 * @{
 */
#define SPIM2_CSEL1_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_FSPICS1_OUT)
#define SPIM2_CSEL1_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_FSPICS1_OUT)
/** @} */

/**
 * @name SPIM2_CSEL2
 * @{
 */
#define SPIM2_CSEL2_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_FSPICS2_OUT)
#define SPIM2_CSEL2_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_FSPICS2_OUT)
/** @} */

/**
 * @name SPIM2_CSEL3
 * @{
 */
#define SPIM2_CSEL3_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_FSPICS3_OUT)
#define SPIM2_CSEL3_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_FSPICS3_OUT)
/** @} */

/**
 * @name SPIM2_CSEL4
 * @{
 */
#define SPIM2_CSEL4_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_FSPICS4_OUT)
#define SPIM2_CSEL4_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_FSPICS4_OUT)
/** @} */

/**
 * @name SPIM2_CSEL5
 * @{
 */
#define SPIM2_CSEL5_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_FSPICS5_OUT)
#define SPIM2_CSEL5_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_FSPICS5_OUT)
/** @} */

/**
 * @name SPIM2_MISO
 * @{
 */
#define SPIM2_MISO_GPIO0 ESP32_PINMUX(0, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO1 ESP32_PINMUX(1, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO2 ESP32_PINMUX(2, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO3 ESP32_PINMUX(3, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO4 ESP32_PINMUX(4, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO5 ESP32_PINMUX(5, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO6 ESP32_PINMUX(6, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO7 ESP32_PINMUX(7, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO8 ESP32_PINMUX(8, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO9 ESP32_PINMUX(9, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO10 ESP32_PINMUX(10, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO11 ESP32_PINMUX(11, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO12 ESP32_PINMUX(12, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO13 ESP32_PINMUX(13, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO14 ESP32_PINMUX(14, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO15 ESP32_PINMUX(15, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO16 ESP32_PINMUX(16, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO17 ESP32_PINMUX(17, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO18 ESP32_PINMUX(18, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO19 ESP32_PINMUX(19, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO20 ESP32_PINMUX(20, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO21 ESP32_PINMUX(21, ESP_FSPIQ_IN, ESP_NOSIG)
/** @} */

/**
 * @name SPIM2_MOSI
 * @{
 */
#define SPIM2_MOSI_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MOSI_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_FSPID_OUT)
/** @} */

/**
 * @name SPIM2_SCLK
 * @{
 */
#define SPIM2_SCLK_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_FSPICLK_OUT)
#define SPIM2_SCLK_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_FSPICLK_OUT)
/** @} */

